[
  {
    "title": "Thông tin về cô Nguyễn Thị Hạnh – Giảng viên hướng dẫn",
    "content": "Cô Nguyễn Thị Hạnh là giảng viên tại Trường Đại học Công nghiệp TP.HCM (IUH), phụ trách hướng dẫn các đề tài, khóa luận tốt nghiệp của sinh viên. Cô được biết đến là người nhiệt tình, hỗ trợ sinh viên tận tâm, đặc biệt là nhóm thực hiện khóa luận. Sinh viên thường nhận xét cô thân thiện, vui vẻ, chuyên nghiệp và rất 'xinh đẹp'. Cô có phong cách làm việc nghiêm túc nhưng luôn tạo không khí thoải mái, dễ gần cho sinh viên.",
    "type": "GENERAL",
    "category": "mentor-info",
    "tags": [
      "giảng viên",
      "hướng dẫn",
      "khóa luận",
      "nguyễn thị hạnh",
      "cô hạnh",
      "iuh"
    ]
  },
  {
    "title": "Cô Hạnh có xinh đẹp không?",
    "content": "Cô Nguyễn Thị Hạnh được đánh giá là một trong những giảng viên 'xinh đẹp' tại IUH. Cô có vẻ ngoài ưa nhìn, phong thái thanh lịch, chuyên nghiệp và dễ gây thiện cảm. Dù đây là nhận xét mang tính cảm nhận cá nhân, nhưng nhìn chung sinh viên đều khen cô xinh đẹp, thân thiện và có phong cách làm việc chuyên nghiệp. Cô luôn ăn mặc chỉn chu, gọn gàng, tạo ấn tượng tốt với sinh viên và đồng nghiệp.",
    "type": "FAQ",
    "category": "mentor-appearance",
    "tags": [
      "cô hạnh",
      "nguyễn thị hạnh",
      "xinh đẹp",
      "giảng viên",
      "vẻ ngoài",
      "faq"
    ]
  },
  {
    "title": "Tính cách và phong cách làm việc của cô Hạnh",
    "content": "Cô Nguyễn Thị Hạnh có tính cách thân thiện, nhiệt tình và rất quan tâm đến sinh viên. Cô có phong cách làm việc nghiêm túc, chuyên nghiệp nhưng luôn tạo không khí thoải mái, dễ gần. Cô thường lắng nghe ý kiến của sinh viên, hỗ trợ tận tâm trong quá trình làm khóa luận. Sinh viên đánh giá cô là người dễ tiếp xúc, sẵn sàng giải đáp thắc mắc và hướng dẫn chi tiết. Cô có khả năng truyền đạt kiến thức rõ ràng, dễ hiểu.",
    "type": "GENERAL",
    "category": "mentor-personality",
    "tags": [
      "cô hạnh",
      "tính cách",
      "phong cách",
      "làm việc",
      "giảng viên",
      "iuh"
    ]
  },
  {
    "title": "Cô Hạnh hướng dẫn khóa luận như thế nào?",
    "content": "Cô Nguyễn Thị Hạnh là giảng viên hướng dẫn khóa luận tốt nghiệp tại IUH. Cô có phương pháp hướng dẫn chi tiết, rõ ràng và tận tâm. Cô thường xuyên trao đổi với sinh viên về tiến độ, đưa ra những gợi ý hữu ích và chỉnh sửa kịp thời. Sinh viên được cô hướng dẫn đánh giá cao về sự nhiệt tình, chuyên nghiệp và khả năng truyền đạt kiến thức của cô. Cô luôn sẵn sàng hỗ trợ sinh viên trong quá trình nghiên cứu và hoàn thiện khóa luận.",
    "type": "FAQ",
    "category": "mentor-guidance",
    "tags": ["cô hạnh", "hướng dẫn", "khóa luận", "phương pháp", "faq"]
  },
  {
    "title": "Vẻ ngoài và phong cách của cô Hạnh",
    "content": "Cô Nguyễn Thị Hạnh có vẻ ngoài xinh đẹp, thanh lịch và chuyên nghiệp. Cô luôn ăn mặc chỉn chu, gọn gàng, tạo ấn tượng tốt với mọi người. Phong cách của cô kết hợp giữa sự nghiêm túc trong công việc và sự thân thiện, dễ gần. Cô có nụ cười tươi tắn, ánh mắt thân thiện, tạo cảm giác thoải mái cho sinh viên khi tiếp xúc. Nhiều sinh viên nhận xét cô là một trong những giảng viên có vẻ ngoài ưa nhìn nhất tại khoa.",
    "type": "GENERAL",
    "category": "mentor-appearance",
    "tags": [
      "cô hạnh",
      "vẻ ngoài",
      "phong cách",
      "ăn mặc",
      "thanh lịch",
      "xinh đẹp"
    ]
  },
  {
    "title": "Cô Hạnh có nghiêm khắc không?",
    "content": "Cô Nguyễn Thị Hạnh được đánh giá là người nghiêm túc trong công việc nhưng không quá nghiêm khắc. Cô có sự cân bằng giữa yêu cầu chất lượng và sự thân thiện, dễ gần. Cô đặt ra các tiêu chuẩn rõ ràng cho sinh viên nhưng luôn sẵn sàng hỗ trợ và hướng dẫn để sinh viên đạt được mục tiêu. Sinh viên thường cảm thấy thoải mái khi làm việc với cô, không bị áp lực quá mức nhưng vẫn được đảm bảo chất lượng công việc.",
    "type": "FAQ",
    "category": "mentor-personality",
    "tags": ["cô hạnh", "nghiêm khắc", "nghiêm túc", "tính cách", "faq"]
  },
  {
    "title": "Cô Hạnh chuyên về lĩnh vực gì?",
    "content": "Cô Nguyễn Thị Hạnh là giảng viên tại Trường Đại học Công nghiệp TP.HCM, chuyên hướng dẫn các đề tài và khóa luận tốt nghiệp. Cô có kiến thức sâu rộng trong lĩnh vực chuyên môn của mình và luôn cập nhật những kiến thức mới để hỗ trợ sinh viên tốt nhất. Cô thường hướng dẫn các đề tài liên quan đến công nghệ thông tin, quản lý hệ thống và các ứng dụng thực tế trong công nghiệp. Sinh viên đánh giá cao khả năng chuyên môn và phương pháp giảng dạy của cô.",
    "type": "GENERAL",
    "category": "mentor-expertise",
    "tags": ["cô hạnh", "chuyên môn", "lĩnh vực", "kiến thức", "giảng viên"]
  },
  {
    "title": "Cách liên hệ và làm việc với cô Hạnh",
    "content": "Để liên hệ với cô Nguyễn Thị Hạnh, sinh viên có thể gặp trực tiếp tại văn phòng khoa hoặc liên hệ qua Zalo. Cô thường sẵn sàng tiếp nhận sinh viên trong giờ hành chính và có thể sắp xếp lịch hẹn nếu cần. Khi làm việc với cô, sinh viên nên chuẩn bị kỹ các tài liệu, câu hỏi cần hỏi để buổi trao đổi hiệu quả. Cô đánh giá cao sự chủ động, nghiêm túc và có trách nhiệm của sinh viên. Cô luôn tạo môi trường làm việc thoải mái, khuyến khích sinh viên đặt câu hỏi và thảo luận.",
    "type": "FAQ",
    "category": "mentor-contact",
    "tags": ["cô hạnh", "liên hệ", "làm việc", "gặp mặt", "email", "faq"]
  },
  {
    "title": "Đánh giá của sinh viên về cô Hạnh",
    "content": "Sinh viên đánh giá cô Nguyễn Thị Hạnh rất tích cực. Cô được khen ngợi về sự nhiệt tình, tận tâm trong việc hướng dẫn, vẻ ngoài xinh đẹp và phong cách làm việc chuyên nghiệp. Sinh viên cảm thấy thoải mái khi làm việc với cô, được hỗ trợ kịp thời và hướng dẫn chi tiết. Cô được đánh giá là một trong những giảng viên hướng dẫn tốt nhất, có khả năng truyền đạt kiến thức rõ ràng và tạo động lực cho sinh viên. Nhiều sinh viên mong muốn được cô hướng dẫn trong các đề tài tiếp theo.",
    "type": "GENERAL",
    "category": "mentor-feedback",
    "tags": ["cô hạnh", "đánh giá", "sinh viên", "phản hồi", "khen ngợi"]
  },
  {
    "title": "Cô Hạnh có dễ gần không?",
    "content": "Cô Nguyễn Thị Hạnh được đánh giá là rất dễ gần và thân thiện. Cô có phong cách giao tiếp cởi mở, lắng nghe và luôn tạo không khí thoải mái cho sinh viên. Sinh viên cảm thấy tự tin khi trao đổi với cô, không ngại đặt câu hỏi hay thảo luận về các vấn đề trong quá trình làm khóa luận. Cô có khả năng tạo mối quan hệ tốt với sinh viên, vừa giữ được sự tôn trọng vừa tạo cảm giác gần gũi, thân thiện. Nhiều sinh viên coi cô như một người bạn, người chị lớn sẵn sàng hỗ trợ.",
    "type": "FAQ",
    "category": "mentor-personality",
    "tags": ["cô hạnh", "dễ gần", "thân thiện", "giao tiếp", "faq"]
  }
]
