[
  {
    "title": "Giới thiệu Đại học Công nghiệp Thành phố Hồ Chí Minh",
    "content": "Tiền thân của Đại học Công nghiệp Thành phố Hồ Chí Minh là Trường Huấn nghiệp Gò Vấp do các tu sĩ dòng Don Bosco thành lập vào ngày 11/11/1956 tại xã Hạnh Thông, Quận Gò Vấp, Tỉnh Gia Định. Năm 1968, trường đổi tên thành Trường tư thục Trung học Kỹ thuật đệ nhất cấp Don Bosco. Đến ngày 31/01/1970, trường được cải biên thành Trường tư thục Trung học Kỹ thuật đệ nhị cấp Don Bosco, gọi tắt là Trường Trung học Kỹ thuật Don Bosco. Sau ngày hòa bình, thống nhất đất nước, quân giải phóng tiếp quản và ngày 19/12/1975 trường được bàn giao cho Tổng cục Cơ khí Luyện kim và Điện tử. Năm 1978, trường đổi tên thành Trường Công nhân Kỹ thuật IV thuộc Bộ Cơ khí và Luyện kim. Đến năm 1994, trường hợp nhất với Trường Trung học Hóa chất II tại Biên Hòa thành Trường Trung học Kỹ thuật Công nghiệp IV, thuộc Bộ Công Nghiệp. Tháng 3/1999, trường nâng cấp thành Trường Cao đẳng Công nghiệp IV và tháng 12/2004, nâng cấp thành Trường Đại học Công nghiệp Thành phố Hồ Chí Minh theo quyết định số 214/2004/QĐ-TTg của Thủ tướng Chính phủ và được phê duyệt thí điểm đổi mới cơ chế hoạt động giai đoạn 2015-2017 theo quyết định số 902/QĐ-TTg, thực hiện từ năm học 2015-2016. Đại học Công nghiệp Thành phố Hồ Chí Minh là một trong những cơ sở giáo dục đại học lớn tại Việt Nam.",
    "type": "GENERAL",
    "category": "school-introduction",
    "tags": [
      "giới thiệu",
      "lịch sử",
      "đại học công nghiệp tphcm",
      "thành lập",
      "các giai đoạn phát triển"
    ]
  },
  {
    "title": "Tầm nhìn, Sứ mạng và Giá trị cốt lõi của Đại học Công nghiệp TP.HCM",
    "content": "1. Tầm nhìn: Trở thành trường đại học hàng đầu của Việt Nam, tiên phong trong giáo dục và nghiên cứu ứng dụng, chuyển giao công nghệ và đổi mới sáng tạo.\n2. Sứ mạng: Cung cấp nguồn nhân lực chất lượng cao, có năng lực, phẩm chất và hội nhập quốc tế, đóng góp cho sự phát triển kinh tế xã hội của đất nước.\n3. Giá trị cốt lõi: Đổi mới - Đoàn kết - Nhân văn.",
    "type": "GENERAL",
    "category": "vision-mission",
    "tags": [
      "tầm nhìn",
      "sứ mạng",
      "giá trị cốt lõi",
      "đại học công nghiệp tphcm"
    ]
  },
  {
    "title": "Trụ sở chính Đại học Công nghiệp TP.HCM",
    "content": "Địa chỉ: Số 12 Nguyễn Văn Bảo, Phường Hạnh Thông, Quận Gò Vấp, TP.HCM\nĐiện thoại: (028) 3894 0390\nWebsite: www.iuh.edu.vn\nEmail: dhcn@iuh.edu.vn\nCác bộ phận liên hệ:\n- Phòng Tổ chức - Hành chính: ptchc@iuh.edu.vn\n- Phòng Tài chính - Kế toán: ptckt@iuh.edu.vn\n- Phòng Đào tạo: phongdaotao@iuh.edu.vn\n- Bộ phận Tuyển sinh: tuyensinh@iuh.edu.vn",
    "type": "FAQ",
    "category": "contact-info",
    "tags": ["trụ sở", "liên hệ", "địa chỉ", "điện thoại", "website", "email"]
  },
  {
    "title": "Phân hiệu Quảng Ngãi - Đại học Công nghiệp TP.HCM",
    "content": "Địa chỉ: Số 938 đường Quang Trung, phường Cẩm Thành, tỉnh Quảng Ngãi\nĐiện thoại: (0255) 2222 135, (0255) 3250 075\nWebsite: www.qn.iuh.edu.vn",
    "type": "FAQ",
    "category": "campus-info",
    "tags": [
      "phân hiệu quảng ngãi",
      "liên hệ",
      "địa chỉ",
      "điện thoại",
      "website"
    ]
  },
  {
    "title": "Cơ sở Thanh Hóa - Đại học Công nghiệp TP.HCM",
    "content": "Địa chỉ: Phường Quảng Phú, thành phố Thanh Hóa, tỉnh Thanh Hóa\nĐiện thoại: (0237) 3675 092\nWebsite: www.th.iuh.edu.vn",
    "type": "FAQ",
    "category": "campus-info",
    "tags": ["cơ sở thanh hóa", "liên hệ", "địa chỉ", "điện thoại", "website"]
  },
  {
    "title": "Cơ sở Phạm Văn Chiêu - Đại học Công nghiệp TP.HCM",
    "content": "Địa chỉ: Đường số 53, Phạm Văn Chiêu, phường An Hội Tây, Thành phố Hồ Chí Minh\nĐiện thoại: (028) 3894 0390\nWebsite: www.iuh.edu.vn",
    "type": "FAQ",
    "category": "campus-info",
    "tags": [
      "cơ sở phạm văn chiêu",
      "liên hệ",
      "địa chỉ",
      "điện thoại",
      "website"
    ]
  },
  {
    "title": "Cơ sở Nguyễn Văn Dung - Đại học Công nghiệp TP.HCM",
    "content": "Địa chỉ: Số 10 Nguyễn Văn Dung, phường An Nhơn, Thành phố Hồ Chí Minh\nĐiện thoại: (028) 3894 0390\nWebsite: www.iuh.edu.vn",
    "type": "FAQ",
    "category": "campus-info",
    "tags": [
      "cơ sở nguyễn văn dung",
      "liên hệ",
      "địa chỉ",
      "điện thoại",
      "website"
    ]
  },
  {
    "title": "Cơ sở Nhơn Trạch - Đại học Công nghiệp TP.HCM",
    "content": "Địa chỉ: Hẻm 1640 đường Hùng Vương, ấp Vũng Gấm, xã Phước An, tỉnh Đồng Nai.\nĐiện thoại: đang cập nhật...\nWebsite: đang cập nhật...",
    "type": "FAQ",
    "category": "campus-info",
    "tags": ["cơ sở nhơn trạch", "liên hệ", "địa chỉ", "điện thoại", "website"]
  }
]
